Repository: saikatportfolio/KidneyBuddy
Catalog: lib/l10n/app_*.arb
Languages: bn, hi

# welcomeTitle
source: Welcome to KidneyBuddy
bn: কিডনিবাডিতে স্বাগতম
hi: किडनीबडी में आपका स्वागत है

# welcomeDescription
source: This app is designed to simplify life for CKD patients by helping them manage their condition and prevent further Progression
bn: এই অ্যাপটি সিকেডি রোগীদের তাদের অবস্থা পরিচালনা করতে এবং আরও অগ্রগতি রোধ করতে সহায়তা করে জীবনকে সহজ করার জন্য ডিজাইন করা হয়েছে
hi: यह ऐप सीकेडी रोगियों के लिए उनकी स्थिति का प्रबंधन करने और आगे बढ़ने से रोकने में मदद करके जीवन को सरल बनाने के लिए डिज़ाइन किया गया है

# renalDietTitle
source: Renal Diet Management
bn: রেনাল ডায়েট ম্যানেজমেন্ট
hi: गुर्दा आहार प्रबंधन

# renalDietDescription
source: Maintain a proper renal diet with personalized guidance and easy-to-follow meal plans tailored to your CKD stage.
bn: আপনার সিকেডি পর্যায়ের জন্য ব্যক্তিগতকৃত নির্দেশিকা এবং সহজে অনুসরণযোগ্য খাবার পরিকল্পনার সাথে একটি সঠিক রেনাল ডায়েট বজায় রাখুন।
hi: अपने सीकेडी चरण के अनुरूप व्यक्तिगत मार्गदर्शन और पालन करने में आसान भोजन योजनाओं के साथ उचित गुर्दा आहार बनाए रखें।

# connectDieticiansTitle
source: Connect with Dieticians
bn: ডায়েটিশিয়ানদের সাথে সংযোগ করুন
hi: आहार विशेषज्ञों से जुड़ें

# connectDieticiansDescription
source: Easily connect with the best dieticians for personalized consultations and expert advice to support your kidney health journey.
bn: আপনার কিডনির স্বাস্থ্য যাত্রাকে সমর্থন করার জন্য ব্যক্তিগত পরামর্শ এবং বিশেষজ্ঞ পরামর্শের জন্য সেরা ডায়েটিশিয়ানদের সাথে সহজেই সংযোগ করুন।
hi: अपने गुर्दे के स्वास्थ्य यात्रा का समर्थन करने के लिए व्यक्तिगत परामर्श और विशेषज्ञ सलाह के लिए सर्वश्रेष्ठ आहार विशेषज्ञों से आसानी से जुड़ें।

# getStartedButton
source: Get Started
bn: শুরু করুন
hi: शुरू करें

# nextButton
source: Next
bn: পরবর্তী
hi: अगला

# patientDetailsTitle
source: Patient Details
bn: রোগীর বিবরণ
hi: रोगी विवरण

# nameLabel
source: Name
bn: নাম
hi: नाम

# phoneNumberLabel
source: Phone Number
bn: ফোন নম্বর
hi: फ़ोन नंबर

# weightLabel
source: Weight (kg)
bn: ওজন (কেজি)
hi: वजन (किग्रा)

# heightLabel
source: Height (cm)
bn: উচ্চতা (সেমি)
hi: ऊंचाई (सेमी)

# ckdStageLabel
source: CKD Stage
bn: সিকেডি পর্যায়
hi: सीकेडी चरण

# saveDetailsButton
source: Save Details
bn: বিস্তারিত সংরক্ষণ করুন
hi: विवरण सहेजें

# feedbackPageTitle
source: Give Your Feedback
bn: আপনার মতামত দিন
hi: अपनी प्रतिक्रिया दें

# yourNameLabel
source: Your Name
bn: আপনার নাম
hi: आपका नाम

# yourPhoneNumberLabel
source: Your Phone Number
bn: আপনার ফোন নম্বর
hi: आपका फ़ोन नंबर

# yourFeedbackLabel
source: Your Feedback
bn: আপনার মতামত
hi: आपकी प्रतिक्रिया

# writeFeedbackHint
source: Write your feedback here...
bn: আপনার মতামত এখানে লিখুন...
hi: अपनी प्रतिक्रिया यहाँ लिखें...

# submitFeedbackButton
source: Submit Feedback
bn: মতামত জমা দিন
hi: प्रतिक्रिया सबमिट करें

# feedbackSubmittedSuccess
source: Feedback submitted successfully!
bn: মতামত সফলভাবে জমা দেওয়া হয়েছে!
hi: प्रतिक्रिया सफलतापूर्वक सबमिट की गई!

# contactDieticianTitle
source: Contact Dietician
bn: ডায়েটিশিয়ানের সাথে যোগাযোগ করুন
hi: आहार विशेषज्ञ से संपर्क करें

source: No dieticians found.
bn: কোন ডায়েটিশিয়ান পাওয়া যায়নি।
hi: कोई आहार विशेषज्ञ नहीं मिला।

# errorFetchingDieticians
source: Error: {error}
bn: ত্রুটি: {error}
hi: त्रुटि: {error}

# experienceLabel
source: Experience: {experience}
bn: অভিজ্ঞতা: {experience}
hi: अनुभव: {experience}

# specialtyLabel
source: Specialty: {specialty}
bn: বিশেষত্ব: {specialty}
hi: विशेषता: {specialty}

# educationLabel
source: Education: {education}
bn: শিক্ষা: {education}
hi: शिक्षा: {education}

# contactWhatsappButton
source: Contact via WhatsApp
bn: হোয়াটসঅ্যাপের মাধ্যমে যোগাযোগ করুন
hi: व्हाट्सएप के माध्यम से संपर्क करें

# couldNotLaunchWhatsapp
source: Could not launch WhatsApp. Make sure it is installed.
bn: হোয়াটসঅ্যাপ চালু করা যায়নি। নিশ্চিত করুন এটি ইনস্টল করা আছে।
hi: व्हाट्सएप लॉन्च नहीं हो सका। सुनिश्चित करें कि यह स्थापित है।

# homePageTitle
source: KidneyBuddy
bn: কিডনিবাডি
hi: किडनीबडी

# dietManagementCard
source: Diet Management
bn: ডায়েট ম্যানেজমেন্ট
hi: आहार प्रबंधन

# dietManagementDescription
source: Manage your diet with personalized recommendations.
bn: ব্যক্তিগত সুপারিশ সহ আপনার ডায়েট পরিচালনা করুন।
hi: व्यक्तिगत सिफारिशों के साथ अपने आहार का प्रबंधन करें।

# vitalMonitoringCard
source: Vital Monitoring
bn: ভাইটাল মনিটরিং
hi: महत्वपूर्ण निगरानी

# vitalMonitoringDescription
source: Track and monitor your vital signs.
bn: আপনার গুরুত্বপূর্ণ লক্ষণগুলি ট্র্যাক এবং নিরীক্ষণ করুন।
hi: अपने महत्वपूर्ण संकेतों को ट्रैक और मॉनिटर करें।

# eGFRCalculatorCard
source: eGFR Calculator
bn: ইজিএফআর ক্যালকুলেটর
hi: ईजीएफआर कैलकुलेटर

# eGFRCalculatorDescription
source: Calculate your eGFR to assess kidney function.
bn: কিডনি ফাংশন মূল্যায়নের জন্য আপনার ইজিএফআর গণনা করুন।
hi: किडनी के कार्य का आकलन करने के लिए अपने ईजीएफआर की गणना करें।

# contactDieticianCard
source: Contact Dietician
bn: ডায়েটিশিয়ানের সাথে যোগাযোগ করুন
hi: आहार विशेषज्ञ से संपर्क करें

# contactDieticianDescription
source: Connect with expert dieticians for personalized advice.
bn: ব্যক্তিগত পরামর্শের জন্য বিশেষজ্ঞ ডায়েটিশিয়ানদের সাথে সংযোগ করুন।
hi: व्यक्तिगत सलाह के लिए विशेषज्ञ आहार विशेषज्ञों से जुड़ें।

# giveYourFeedbackCard
source: Give your Feedback
bn: আপনার মতামত দিন
hi: अपनी प्रतिक्रिया दें

# giveYourFeedbackDescription
source: Share your thoughts and help us improve the app.
bn: আপনার চিন্তা শেয়ার করুন এবং অ্যাপ উন্নত করতে আমাদের সাহায্য করুন।
hi: अपने विचार साझा करें और ऐप को बेहतर बनाने में हमारी मदद करें।

# notYetImplemented
source: Navigating to {title} (Not yet implemented)
bn: {title} এ নেভিগেট করা হচ্ছে (এখনও বাস্তবায়িত হয়নি)
hi: {title} पर नेविगेट करना (अभी तक लागू नहीं किया गया)

# selectLanguageTitle
source: Select Language
bn: ভাষা নির্বাচন করুন
hi: भाषा चुनें

# chooseYourLanguage
source: Choose your preferred language
bn: আপনার পছন্দের ভাষা নির্বাচন করুন
hi: अपनी पसंदीदा भाषा चुनें

source: English
bn: ইংরেজি
hi: अंग्रेज़ी

source: Hindi
bn: হিন্দি
hi: हिंदी

source: Bengali
bn: বাংলা
hi: बंगाली

# settingsTitle
source: Settings
bn: সেটিংস
hi: सेटिंग्स

# languageSetting
source: Language
bn: ভাষা
hi: भाषा

# vitalTrackingPageTitle
source: Vital Tracking
bn: ভাইটাল ট্র্যাকিং
hi: महत्वपूर्ण ट्रैकिंग

# bpTab
source: Blood Pressure
bn: রক্তচাপ
hi: रक्तचाप

# creatinineTab
source: Creatinine
bn: ক্রিয়েটিনিন
hi: क्रिएटिनिन

# potassiumTab
source: Potassium
bn: পটাশিয়াম
hi: पोटेशियम

# noDataAvailable
source: No data available for this category.
bn: এই বিভাগের জন্য কোন ডেটা উপলব্ধ নেই।
hi: इस श्रेणी के लिए कोई डेटा उपलब्ध नहीं है।

# addBpButton
source: Add Blood Pressure
bn: রক্তচাপ যোগ করুন
hi: रक्तचाप जोड़ें

# addCreatinineButton
source: Add Creatinine
bn: ক্রিয়েটিনিন যোগ করুন
hi: क्रिएटिनिन जोड़ें

# addPotassiumButton
source: Add Potassium
bn: পটাশিয়াম যোগ করুন
hi: पोटेशियम जोड़ें

# addBpPageTitle
source: Add Blood Pressure Reading
bn: রক্তচাপ রিডিং যোগ করুন
hi: रक्तचाप रीडिंग जोड़ें

# systolicLabel
source: Systolic
bn: সিস্টোলিক
hi: सिस्टोलिक

# diastolicLabel
source: Diastolic
bn: ডায়াস্টোলিক
hi: डायस्टोलिक

# addCommentLabel
source: Add Comment
bn: মন্তব্য যোগ করুন
hi: टिप्पणी जोड़ें

# selectDateLabel
source: Select Date
bn: তারিখ নির্বাচন করুন
hi: दिनांक चुनें

# selectTimeLabel
source: Select Time
bn: সময় নির্বাচন করুন
hi: समय चुनें

# saveButton
source: Save
bn: সংরক্ষণ করুন
hi: सहेजें

# loginTitle
source: Login
bn: লগইন
hi: लॉग इन करें

# loginSuccessMessage
source: Logged in successfully!
bn: সফলভাবে লগইন করা হয়েছে!
hi: सफलतापूर्वक लॉग इन किया गया!

# authErrorMessage
source: Authentication Error: {error}
bn: প্রমাণীকরণ ত্রুটি: {error}
hi: प्रमाणीकरण त्रुटि: {error}

# pdfGenerationErrorNoPatientDetails
source: Patient details not available for PDF report. Please update your profile.
bn: পিডিএফ প্রতিবেদনের জন্য রোগীর বিবরণ উপলব্ধ নেই। অনুগ্রহ করে আপনার প্রোফাইল আপডেট করুন।
hi: पीडीएफ रिपोर्ट के लिए रोगी विवरण उपलब्ध नहीं है। कृपया अपनी प्रोफ़ाइल अपडेट करें।

# pdfGenerationErrorNoReadings
source: No blood pressure readings available to generate a PDF report.
bn: পিডিএফ প্রতিবেদন তৈরি করার জন্য কোনো রক্তচাপ রিডিং উপলব্ধ নেই।
hi: पीडीएफ रिपोर्ट बनाने के लिए कोई रक्तचाप रीडिंग उपलब्ध नहीं है।

# pdfGenerationError
source: Error generating PDF report: {error}
bn: পিডিএফ প্রতিবেদন তৈরি করতে ত্রুটি: {error}
hi: पीडीएफ रिपोर्ट बनाने में त्रुटि: {error}

# userNotLoggedIn
source: User not logged in. Please sign in to view this content.
bn: ব্যবহারকারী লগ ইন করেননি। এই সামগ্রী দেখতে অনুগ্রহ করে সাইন ইন করুন।
hi: उपयोगकर्ता लॉग इन नहीं है। इस सामग्री को देखने के लिए कृपया साइन इन करें।

# signOutButton
source: Sign Out
bn: সাইন আউট করুন
hi: साइन आउट करें

# signOutConfirmation
source: Are you sure you want to sign out?
bn: আপনি কি নিশ্চিত যে আপনি সাইন আউট করতে চান?

# yesButton
source: Yes
bn: হ্যাঁ

# noButton
source: No
bn: না
